contiki-os/contiki/platform/stm32nucleo-spirit1/drivers/spirit1/inc/SPIRIT_Regs.h
/** @defgroup PROTOCOL0_Register
 * @{
 */

/**
 *  \brief PROTOCOL0  register
 *  \code
 *   Default value: 0x08
 *   Read Write
 *   7:4   NMAX_RETX[3:0]:             Max number of re-TX.  0 - re-transmission is not performed
 *
 *   3     NACK_TX[0]:                 1 - field NO_ACK=1 on transmitted packet
 *
 *   2     AUTO_ACK[0]:                1 - automatic ack after RX
 *
 *   1     PERS_RX[0]:                 1 - persistent reception enabled
 *
 *   0     PERS_TX[0]:                 1 - persistent transmission enabled
 *
 *   \endcode
 */
#define	PROTOCOL0_BASE						((uint8_t)0x52) /*!< Persistent RX/TX, autoack, Max number of retransmissions */

#define	PROTOCOL0_PERS_TX_MASK				        ((uint8_t)0x01) /*!< Enables persistent transmission */
#define	PROTOCOL0_PERS_RX_MASK				        ((uint8_t)0x02) /*!< Enables persistent reception */
#define	PROTOCOL0_AUTO_ACK_MASK				        ((uint8_t)0x04) /*!< Enables auto acknowlegment */
#define	PROTOCOL0_NACK_TX_MASK				        ((uint8_t)0x08) /*!< Writes field NO_ACK=1 on transmitted packet */
#define	PROTOCOL0_NMAX_RETX_MASK                                ((uint8_t)0xF0) /*!< Retransmission mask */

/**
 * @}
 */

/** @defgroup TIMERS5_Register
 * @{
 */

/**
 *  \brief TIMERS5  register
 *  \code
 *   Default value: 0x00
 *   Read Write
 *   7:0   RX_TIMEOUT_PRESCALER[7:0] :             RX operation timeout: prescaler value
 *   \endcode
 */
#define	TIMERS5_RX_TIMEOUT_PRESCALER_BASE			((uint8_t)0x53) /*!< RX operation timeout: prescaler value */

/**
 * @}
 */

/** @defgroup TIMERS4_Register
 * @{
 */

/**
 *  \brief TIMERS4  register
 *  \code
 *   Default value: 0x00
 *   Read Write
 *   7:0   RX_TIMEOUT_COUNTER[7:0] :               RX operation timeout: counter value
 *   \endcode
 */
#define	TIMERS4_RX_TIMEOUT_COUNTER_BASE				((uint8_t)0x54) /*!< RX operation timeout: counter value */

/**
 * @}
 */

/** @defgroup TIMERS3_Register
 * @{
 */

/**
 *  \brief TIMERS3  register
 *  \code
 *   Default value: 0x00
 *   Read Write
 *   7:0   LDCR_PRESCALER[7:0] :                   LDC Mode: Prescaler part of the wake-up value
 *   \endcode
 */
#define	TIMERS3_LDC_PRESCALER_BASE				((uint8_t)0x55) /*!< LDC Mode: Prescaler of the wake-up timer */

/**
 * @}
 */

/** @defgroup TIMERS2_Register
 * @{
 */

/**
 *  \brief TIMERS2  register
 *  \code
 *   Default value: 0x00
 *   Read Write
 *   7:0   LDCR_COUNTER[7:0] :                    LDC Mode: counter part of the wake-up value
 *   \endcode
 */
#define	TIMERS2_LDC_COUNTER_BASE				((uint8_t)0x56) /*!< LDC Mode: counter of the wake-up timer */

/**
 * @}
 */

/** @defgroup TIMERS1_Register
 * @{
 */

/**
 *  \brief TIMERS1  register
 *  \code
 *   Default value: 0x00
 *   Read Write
 *   7:0   LDCR_RELOAD_PRESCALER[7:0] :           LDC Mode: Prescaler part of the reload value
 *   \endcode
 */
#define	TIMERS1_LDC_RELOAD_PRESCALER_BASE			((uint8_t)0x57) /*!< LDC Mode: Prescaler part of the reload value */

/**
 * @}
 */

/** @defgroup TIMERS0_Register
 * @{
 */

/**
 *  \brief TIMERS0  register
 *  \code
 *   Default value: 0x00
 *   Read Write
 *   7:0   LDCR_RELOAD_COUNTER[7:0] :           LDC Mode: Counter part of the reload value
 *   \endcode
 */
#define	TIMERS0_LDC_RELOAD_COUNTER_BASE				((uint8_t)0x58) /*!< LDC Mode: Counter part of the reload value */

/**
 * @}
 */


/** @defgroup CSMA_CONFIG3_Register
 * @{
 */

/**
 *  \brief CSMA_CONFIG3  registers
 *  \code
 *   Default value: 0xFF
 *   Read Write
 *   7:0     BU_COUNTER_SEED_MSByte: Seed of the random number generator used to apply the BEB (Binary Exponential Backoff) algorithm (MSB)
 *   \endcode
 */
#define	CSMA_CONFIG3_BASE		                      ((uint8_t)0x64) /*!< CSMA/CA: Seed of the random number generator used to apply the BEB (Binary Exponential Backoff) algorithm (MSB) */

/**
 * @}
 */

/** @defgroup CSMA_CONFIG2_Register
 * @{
 */

/**
 *  \brief CSMA_CONFIG2  registers
 *  \code
 *   Default value: 0x00
 *   Read Write
 *   7:0     BU_COUNTER_SEED_LSByte: Seed of the random number generator used to apply the BEB (Binary Exponential Backoff) algorithm (LSB)
 *   \endcode
 */
#define	CSMA_CONFIG2_BASE		                      ((uint8_t)0x65) /*!< CSMA/CA: Seed of the random number generator used to apply the BEB (Binary Exponential Backoff) algorithm (LSB) */

/**
 * @}
 */

/** @defgroup CSMA_CONFIG1_Register
 * @{
 */

/**
 *  \brief CSMA_CONFIG1  registers
 *  \code
 *   Default value: 0x04
 *   Read Write
 *   7:2     BU_PRESCALER[5:0]: Used to program the back-off unit BU
 *
 *   1:0     CCA_PERIOD[1:0]: Used to program the Tcca time (64 / 128 /256 / 512 × Tbit.
 *   \endcode
 */
#define	CSMA_CONFIG1_BASE				      ((uint8_t)0x66) /*!< CSMA/CA: Prescaler of the back-off time unit (BU); CCA period */

#define	CSMA_CCA_PERIOD_64TBIT				      ((uint8_t)0x00) /*!< CSMA/CA: Sets CCA period to 64*TBIT */
#define	CSMA_CCA_PERIOD_128TBIT				      ((uint8_t)0x01) /*!< CSMA/CA: Sets CCA period to 128*TBIT */
#define	CSMA_CCA_PERIOD_256TBIT				      ((uint8_t)0x02) /*!< CSMA/CA: Sets CCA period to 256*TBIT */
#define	CSMA_CCA_PERIOD_512TBIT				      ((uint8_t)0x03) /*!< CSMA/CA: Sets CCA period to 512*TBIT */

/**
 * @}
 */

/** @defgroup CSMA_CONFIG0_Register
 * @{
 */

/**
 *  \brief CSMA_CONFIG0  registers
 *  \code
 *   Default value: 0x00
 *   Read Write
 *   7:4     CCA_LENGTH[3:0]: Used to program the Tlisten time
 *
 *   3       Reserved.
 *
 *   2:0     NBACKOFF_MAX[2:0]: Max number of back-off cycles.
 *   \endcode
 */
#define	CSMA_CONFIG0_BASE				      ((uint8_t)0x67) /*!< CSMA/CA: CCA lenght; Max number of backoff cycles */

/**
 * @}
 */

/**
 * @}
 */


/** @defgroup Link_Quality_Registers
 * @{
 */

/** @defgroup QI_Register
 * @{
 */

/**
 *  \brief QI register
 *  \code
 *   Read Write
 *   Default value: 0x02
 *
 *   7:6   SQI_TH[1:0]: SQI threshold according to the formula: 8*SYNC_LEN - 2*SQI_TH
 *
 *   5:2   PQI_TH[3:0]: PQI threshold according to the formula: 4*PQI_THR
 *
 *
 *   1     SQI_EN[0]:  SQI enable
 *                 1 - Enable
 *                 0 - Disable
 *
 *   0     PQI_EN[0]: PQI enable
 *                 1 - Enable
 *                 0 - Disable
 *   \endcode
 */
#define	QI_BASE							((uint8_t)0x3A) /*!< QI register */

#define	QI_PQI_MASK					        ((uint8_t)0x01) /*!< PQI enable/disable  */
#define	QI_SQI_MASK					        ((uint8_t)0x02) /*!< SQI enable/disable  */

/**
 * @}
 */

/** @defgroup LINK_QUALIF2
 * @{
 */

/**
 *  \brief LINK_QUALIF2  registers
 *  \code
 *   Default value: 0x00
 *   Read
 *
 *   7:0   PQI[7:0]: PQI value of the received packet
 *   \endcode
 */
#define	LINK_QUALIF2_BASE					((uint8_t)(0xC5)) /*!< PQI value of the received packet */

/**
 * @}
 */

/** @defgroup LINK_QUALIF1
 * @{
 */

/**
 *  \brief LINK_QUALIF1  registers
 *  \code
 *   Default value: 0x00
 *   Read
 *
 *   7 CS:  Carrier Sense indication
 *
 *   6:0   SQI[6:0]: SQI value of the received packet
 *   \endcode
 */
#define	LINK_QUALIF1_BASE					((uint8_t)(0xC6)) /*!< Carrier sense indication [7]; SQI value of the received packet */

#define	LINK_QUALIF1_CS						((uint8_t)(0x80)) /*!< Carrier sense indication [7] */

/**
 * @}
 */

/** @defgroup LINK_QUALIF0
 * @{
 */

/**
 *  \brief LINK_QUALIF0  registers
 *  \code
 *   Default value: 0x00
 *   Read
 *
 *   7:4   LQI [3:0]:  LQI value of the received packet
 *
 *   3:0   AGC_WORD[3:0]: AGC word of the received packet
 *   \endcode
 */
#define	LINK_QUALIF0_BASE					((uint8_t)(0xC7)) /*!< LQI value of the received packet [7:4]; AGC word of the received packet [3:0] */

/**
 * @}
 */

/** @defgroup RSSI_LEVEL
 * @{
 */

/**
 *  \brief RSSI_LEVEL  registers
 *  \code
 *   Default value: 0x00
 *   Read
 *
 *   7:0   RSSI_LEVEL[7:0]:  RSSI level of the received packet
 *   \endcode
 */
#define	RSSI_LEVEL_BASE						((uint8_t)(0xC8)) /*!< RSSI level of the received packet */

/**
 * @}
 */

/** @defgroup RSSI_FLT_Register
 * @{
 */

/**
 *  \brief RSSI register
 *  \code
 *   Read Write
 *   Default value: 0xF3
 *   7:4  RSSI_FLT[3:0]: Gain of the RSSI filter
 *
 *   3:2  CS_MODE[1:0]: AFC loop gain in slow mode (2's log)
 *
 *          CS_MODE1       |        CS_MODE0       |                     CS Mode
 *       -----------------------------------------------------------------------------------------
 *             0           |           0           |        Static CS
 *             0           |           1           |        Dynamic CS with 6dB dynamic threshold
 *             1           |           0           |        Dynamic CS with 12dB dynamic threshold
 *             1           |           1           |        Dynamic CS with 18dB dynamic threshold
 *
 *   1:0   OOK_PEAK_DECAY[1:0]: Peak decay control for OOK: 3 slow decay; 0 fast decay
 *
 *   \endcode
 */
#define	RSSI_FLT_BASE						((uint8_t)0x21) /*!< Gain of the RSSI filter; lower value is fast but inaccurate,
																	higher value is slow and more accurate */
#define RSSI_FLT_CS_MODE_MASK					((uint8_t)0x0C) /*!< Carrier sense mode mask */
#define RSSI_FLT_CS_MODE_STATIC					((uint8_t)0x00) /*!< Carrier sense mode;  static carrier sensing */
#define RSSI_FLT_CS_MODE_DYNAMIC_6				((uint8_t)0x04) /*!< Carrier sense mode;  dynamic carrier sensing with 6dB threshold */
#define RSSI_FLT_CS_MODE_DYNAMIC_12				((uint8_t)0x08) /*!< Carrier sense mode;  dynamic carrier sensing with 12dB threshold */
#define RSSI_FLT_CS_MODE_DYNAMIC_18				((uint8_t)0x0C) /*!< Carrier sense mode;  dynamic carrier sensing with 18dB threshold */
#define RSSI_FLT_OOK_PEAK_DECAY_MASK			        ((uint8_t)0x03) /*!< Peak decay control for OOK mask */
#define RSSI_FLT_OOK_PEAK_DECAY_FAST			        ((uint8_t)0x00) /*!< Peak decay control for OOK: fast decay */
#define RSSI_FLT_OOK_PEAK_DECAY_MEDIUM_FAST		        ((uint8_t)0x01) /*!< Peak decay control for OOK: medium_fast decay */
#define RSSI_FLT_OOK_PEAK_DECAY_MEDIUM_SLOW		        ((uint8_t)0x02) /*!< Peak decay control for OOK: medium_fast decay */
#define RSSI_FLT_OOK_PEAK_DECAY_SLOW			        ((uint8_t)0x03) /*!< Peak decay control for OOK: slow decay */

/**
 * @}
 */

/** @defgroup RSSI_TH_Register
 * @{
 */

/**
 *  \brief RSSI_TH register
 *  \code
 *   Read Write
 *   Default value: 0x24
 *
 *   7:0 RSSI_THRESHOLD [7:0]:    Signal detect threshold in 0.5dB.  -120dBm corresponds to 20
 *   \endcode
 */
#define	RSSI_TH_BASE						((uint8_t)0x22) /*!< Signal detect threshold in 0.5dB stp. 20 correspond to -120 dBm */

/**
 * @}
 */

/**
 * @}
 */


/** @defgroup FIFO_Registers
 * @{
 */

